src/integrationTest/resources/pm-templates/v3/core/wfs/auth/login-as-manager.request.yaml

$kind: http-request
description: >-
  SOAP login (v64) as the MANAGER persona, minting {{managerToken}} — its OWN least-privilege
  WorkforceScheduling session, NOT the admin session. This is the load-bearing persona-auth retrofit:
  every WFS policy/fixture/act folder declares {{managerToken}}, so once this step sets it to a real
  manager session, the manager OWNS the policy + fixture rows it later books/reads against (the
  Decision-9 sharing model applied to the write/read parity decisions). SOAP login stays at v64 (the
  scheduling tooling REST stays on the dynamic versionPath); mirrors auth-personas-dec9 30-login-as-manager.
  Runs after set-manager-password (17500).
url: "{{baseUrl}}/services/Soap/u/64.0"
method: POST
headers:
  Content-Type: text/xml
  SOAPAction: login
  charset: UTF-8
  Accept: text/xml
body:
  type: text
  content: |-
    <?xml version="1.0" encoding="utf-8" ?>
    <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
      <env:Body>
        <n1:login xmlns:n1="urn:partner.soap.sforce.com">
          <n1:username><![CDATA[{{managerUserName}}]]></n1:username>
          <n1:password><![CDATA[{{managerPersonaPassword}}]]></n1:password>
        </n1:login>
      </env:Body>
    </env:Envelope>
scripts:
  - type: afterResponse
    code: |-
      var xml2js = require('xml2js')
      xml2js.parseString(pm.response.text(), { explicitArray: false }, (_, j) => {
        let r = j['soapenv:Envelope']['soapenv:Body'].loginResponse.result
        pm.environment.set("managerToken", r.sessionId)
        pm.environment.set("managerUserId", r.userId)
      })
    language: text/javascript
settings:
  disabledSystemHeaders:
    - accept
    - content-type
    - user-agent
order: 18000
